# -*- coding: utf-8 -*-
# !/usr/bin/env python3

"""
1. Проверить, установлен ли пакет pillow в глобальном окружении. Если да — зафиксировать версию.
    01. Установить самую свежую версию pillow, если ранее она не была установлена. Сделать подтверждающий скриншот.
    02. Создать и активировать виртуальное окружение. Убедиться, что в нем нет пакета pillow. Сделать подтверждающий
    скриншот.
    03. Установить в виртуальное окружение pillow версии 7.1.1 (или другой, отличной от самой свежей). Сделать
    подтверждающий скриншот.
    04. Деактивировать виртуальное окружение. Сделать подтверждающий скриншот.
Скрины нумеровать двухразрядными числами, например: «01.jpg», «02.jpg». Если будут проблемы с pillow - можно поработать
с другим пакетом: например, requests.
"""